#**C.Manipulasi Data Dengan Apache Spark SQL**
##**[GROUP BY, INNER JOIN & UNION ]**

##**1. Hadoop & PySpark initialization di Google Colab**

*PySpark* adalah *interface Python* untuk *Apache Spark*. Penggunaan utama *PySpark* adalah untuk bekerja dengan data dalam Bigdata dan untuk membuat pipeline data.

Walaupun *Apache Spark* mendudukung Big Data, sebagai awal pembelajaran tidak perlu menggunakan data yang besar untuk mendapatkan manfaat dari PySpark. Kita bisa temukan bahwa SparkSQL adalah tools yang bagus untuk melakukan analisis data. Penggunaan library Panda menjadi lambat dengan data yang besar Sumber tentang Apache Spark http://spark.apache.org/docs/latest/api/python/

In [ ]:
#Init Hadoop & Spark
#=====Begin

#=====End

Lakukan manipulasi data dari dataset pada tautan berikut:

"https://github.com/rahmadsa/dataset/blob/main/ms_produk.csv"

Dengan perintah - perintah SQL berikut pada platform Apache Spark SQL

#**2. Manipulasi Data Dengan GROUP BY Statment**

Lakukan manipulasi data dari dataset pada tautan berikut:

"https://github.com/rahmadsa/dataset/blob/main/ms_produk.csv?raw=true"

Dengan perintah - perintah SQL berikut pada platform Apache Spark SQL

##2.1. [Group by Single Column](https://#)
```
SELECT province,
COUNT(DISTINCT order_id) AS total_order,
SUM(item_price) AS total_price
FROM sales_retail_2019
GROUP BY province;
```

In [ ]:
SELECT province,
COUNT(DISTINCT order_id) AS total_order,
SUM(item_price) AS total_price
FROM sales_retail_2019
GROUP BY province;

# 2.2. [Group by Multiple Column](https://#)
```
SELECT province,brand,
COUNT(DISTINCT order_id) AS total_order,
SUM(Item_price) AS total_price FROM sales_retail_2019
GROUP BY province, brand;
```

In [ ]:
SELECT;

## 2.3. [Fungsi Aggregate dengan Grouping](https://#)
```
SELECT province,
COUNT(DISTINCT order_id) AS total_unique_order,
SUM(item_price) AS revenue
FROM sales_retail_2019
GROUP BY province;
```

In [ ]:
SELECT ;

#**3. Manipulasi Data Dengan INNER JOIN**

Fungsi dalam SQL adalah blok kode terstruktur yang melakukan tugas tertentu dan dapat dipanggil berkali-kali. Fungsi ini membantu menyederhanakan dan mengoptimalkan kueri SQL, serta memungkinkan penggunaan kembali kode

Lakukan manipulasi data dari dataset pada tautan berikut:

"https://github.com/rahmadsa/dataset/blob/main/ms_produk.csv?raw=true"

Dengan perintah - perintah SQL berikut pada platform Apache Spark SQL

##3.1. [SELECT Beberapa Tabel Tanpa JOIN Statment](https://#)
```
SELECT * FROM ms_item_kategori;
SELECT * FROM ms_item_warna ;
```

In [ ]:
SELECT ;

## 3.2. [Menggabungkan Tabel dengan Key Columns](https://#)
```
SELECT * FROM ms_item_kategori, ms_item_warna
WHERE nama_barang = nama_item;
```

In [ ]:
SELECT ;

##3.3 [Bagaimana jika urutan Tabel diubah?](https://#)
```
SELECT * FROM ms_item_warna, ms_item_kategori
WHERE nama_barang=nama_item;
```

In [ ]:
SELECT ;

##3.4. [Menggunakan Prefix Nama Tabel](https://#)
```
  SELECT ms_item_kategori.*, ms_item_warna.*
  FROM ms_item_warna, ms_item_kategori
  WHERE nama_barang=nama_item;
```

In [ ]:
SELECT;

##3.5. [Penggabungan Tanpa Kondisi](https://#)
```
SELECT * FROM ms_item_kategori, ms_item_warna;
```

In [ ]:
SELECT * FROM ms_item_kategori, ms_item_warna;

## 3.6. [tabel tr_penjualan dan tabel ms_produk](https://#)
```
SELECT * FROM tr_penjualan;
SELECT * FROM ms_produk;
```

In [ ]:
SELECT ;

#**4. Manipulasi Data Dengan UNION**

Fungsi dalam SQL adalah blok kode terstruktur yang melakukan tugas tertentu dan dapat dipanggil berkali-kali. Fungsi ini membantu menyederhanakan dan mengoptimalkan kueri SQL, serta memungkinkan penggunaan kembali kode

Lakukan manipulasi data dari dataset pada tautan berikut:

"https://github.com/rahmadsa/dataset/blob/main/ms_produk.csv?raw=true"

Dengan perintah - perintah SQL berikut pada platform Apache Spark SQL

##4.1. [Tabel yang Akan Digabungkan](https://#)
```
SELECT * FROM tabel_a;
SELECT * FROM tabel_b;
```

In [ ]:
SELECT ;

## 4.2. [Menggunakan UNION](https://#)
```
SELECT * FROM tabel_A
UNION
SELECT * FROM tabel_B;
```

In [ ]:
SELECT ;

##4.3 [Menggunakan UNION dengan Klausa WHERE](https://#)
```
SELECT * FROM tabel_A
WHERE kode_pelanggan='labcust03'
UNION
SELECT * FROM tabel_B
WHERE kode_pelanggan='labcust03';
```

In [ ]:
SELECT ;

##4.4. [Menggunakan UNION dan Menyelaraskan Kolom-Kolomnya](https://#)
```
SELECT CustomerName, ContactName, City, PostalCode
FROM Customers
UNION
SELECT SupplierName, ContactName, City, PostalCode
FROM Suppliers;
```

In [ ]:
SELECT ;

#**5. Tugas**

Fungsi dalam SQL adalah blok kode terstruktur yang melakukan tugas tertentu dan dapat dipanggil berkali-kali.

Lakukan manipulasi data dari dataset pada tautan berikut:

"https://github.com/rahmadsa/dataset/blob/main/ms_produk.csv?raw=true"

Dengan perintah - perintah SQL berikut pada platform Apache Spark SQL

## 5.1 [Tugas Praktek-3.2](https://#)
```
SELECT MONTH(order_date) AS order_month, SUM(item_price) AS total_price,
CASE
    WHEN SUM(item_price) >= 30000000000 THEN 'Target Achieved'
    WHEN SUM(item_price) <= 25000000000 THEN 'Less Performed'
    ELSE 'Follow Up'
END as remark
FROM sales_retail_2019
GROUP BY MONTH(order_date);
```

In [ ]:
SELECT ;

##5.2. [Proyek Pekerjaan - Analisis Penjualan Part 1](https://#)
-- a. Total jumlah seluruh penjualan (total/revenue).
```
SELECT SUM(total) as total
FROM tr_penjualan;
```
-- b. Total quantity seluruh produk yang terjual.
```
SELECT SUM(qty) as qty
FROM tr_penjualan;
```
-- c. Total quantity dan total revenue untuk setiap kode produk.
```
SELECT kode_produk, SUM(qty) as qty, SUM(total) as total
FROM tr_penjualan
GROUP BY kode_produk;
```

In [ ]:
# a. Total jumlah seluruh penjualan (total/revenue).
# b. Total quantity seluruh produk yang terjual.
# c. Total quantity dan total revenue untuk setiap kode produk.

##5.3 [Proyek Pekerjaan - Analisis Penjualan Part 2](https://#)
-- d. Rata - Rata total belanja per kode pelanggan.
```
SELECT kode_pelanggan, AVG(total) AS avg_total
FROM tr_penjualan
GROUP BY kode_pelanggan;
```
-- e. Selain itu,  jangan lupa untuk menambahkan kolom baru
dengan nama ‘kategori’ yang mengkategorikan total/revenue ke dalam
3 kategori: High: > 300K; Medium: 100K - 300K; Low: <100K.
```
SELECT kode_transaksi,kode_pelanggan,no_urut,kode_produk,nama_produk,qty,total,
CASE
    WHEN total > 300000 THEN 'High'
    WHEN total < 100000 THEN 'Low'
    ELSE 'Medium'
END as kategori
FROM tr_penjualan;
```

In [ ]:
#-- d. Rata - Rata total belanja per kode pelanggan.

#-- e Selain itu,  jangan lupa untuk menambahkan kolom baru

##5.4. [Tugas Praktek: Menggunakan INNER JOIN (1/3)](https://academy.dqlab.id/main/livecode/244/407/2051?pr=0)
```
SELECT * FROM ms_item_warna
INNER JOIN ms_item_kategori
ON ms_item_warna.nama_barang = ms_item_kategori.nama_item;
```

In [ ]:
SELECT ;

## 5.5. [Tugas Praktek: Menggunakan INNER JOIN (2/3)](https://#)
```
SELECT *
FROM tr_penjualan
INNER JOIN ms_produk
ON tr_penjualan.kode_produk = ms_produk.kode_produk;
```

In [ ]:
SELECT ;

##5.6. [Tugas Praktek: Menggunakan INNER JOIN (2/3)](https://#)
```
SELECT *
FROM tr_penjualan
INNER JOIN ms_produk
ON tr_penjualan.kode_produk = ms_produk.kode_produk;
```

In [ ]:
SELECT ;

##5.7 [Tugas Praktek: Menggunakan INNER JOIN (3/3)](https://#)

In [ ]:
SELECT tr_penjualan.kode_transaksi,	tr_penjualan.kode_pelanggan,tr_penjualan.kode_produk,ms_produk.nama_produk,ms_produk.harga,tr_penjualan.qty,ms_produk.harga * tr_penjualan.qty AS total
FROM tr_penjualan
INNER JOIN ms_produk
ON tr_penjualan.kode_produk = ms_produk.kode_produk